//======= ∵ ƸӜƷ ∴ ============================================//
//======================= ∵ NPƸӜƷL1M ∴ =======================//
//================================================ 2024 ======//
class ArtistFetcher{
    /// code 

}

class MediaFetcher{
    //code
}

class MediaImage extends MediaFetcher {
    //code
}

class MediaVideo extends MediaFetcher{
    //code
}

//======= ∵ ƸӜƷ ∴ ============================================//
//======================= ∵ NPƸӜƷL1M ∴ =======================//
//=== SINCE PYRAMIDS ============================= 2024 ======//